In [2]:
# Dependencies
import pandas as pd

In [3]:
# Save path to data set in a variable
data_file = "Resources/dataSet.csv"

In [4]:
# Use Pandas to read data
data_file_pd = pd.read_csv(data_file)
data_file_pd.head()

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9
5   6    Raymond   Andrews      M   7036.9
6   7     Sandra     Baker      F  14002.2
7   8       Todd      Diaz      M  10911.0
8   9      Alice     Burke      F  14198.8
9  10      Wayne  Richards      M  16410.5

In [5]:
# Display a statistical overview of the DataFrame
data_file_pd.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000  10051.323600
std     288.819436   5831.230806
min       1.000000      3.400000
25%     250.750000   4854.875000
50%     500.500000  10318.050000
75%     750.250000  15117.425000
max    1000.000000  19987.400000

In [9]:
# Reference a single column within a DataFrame
data_file_pd["Amount"].describe()

count     1000.000000
mean     10051.323600
std       5831.230806
min          3.400000
25%       4854.875000
50%      10318.050000
75%      15117.425000
max      19987.400000
Name: Amount, dtype: float64

In [10]:
# Reference multiple columns within a DataFrame
data_file_pd[["Amount","Gender", "id"]].head()

    Amount Gender  id
0   8067.7      M   1
1   7330.1      M   2
2  16335.0      F   3
3  12460.8      F   4
4  15271.9      F   5

In [11]:
# The mean method averages the series 
average = data_file_pd["Amount"].mean()
average

500.5

In [14]:
# The sum method adds every entry in the series
total = data_file_pd["Amount"].sum()
total

10051323.600000001

In [15]:
# The unique method shows every element of the series that appears only once
unique = data_file_pd["First Name"].unique()
unique

array(['Todd', 'Joshua', 'Mary', 'Emily', 'Christina', 'Raymond', 'Sandra',
       'Alice', 'Wayne', 'Brian', 'Johnny', 'Ronald', 'John', 'Steven',
       'Pamela', 'Stephen', 'Larry', 'Jeffrey', 'Betty', 'Howard', 'Jose',
       'Tammy', 'Benjamin', 'Robin', 'Billy', 'Michael', 'Jennifer',
       'Richard', 'Margaret', 'Lisa', 'Samuel', 'Rebecca', 'William',
       'Philip', 'Theresa', 'Anthony', 'Antonio', 'Paul', 'Louise',
       'Jesse', 'Deborah', 'Marie', 'Patrick', 'Evelyn', 'Jonathan',
       'Daniel', 'Kevin', 'Ashley', 'Doris', 'Diana', 'Joseph', 'Nancy',
       'Sarah', 'Lois', 'Amy', 'Marilyn', 'Elizabeth', 'Fred', 'Bobby',
       'Paula', 'Judith', 'Stephanie', 'Justin', 'Terry', 'Peter',
       'Kathryn', 'Rachel', 'Kathy', 'Wanda', 'Randy', 'Martha',
       'Christopher', 'Aaron', 'Jeremy', 'Gloria', 'Alan', 'Amanda',
       'Barbara', 'Rose', 'Norma', 'Edward', 'Sara', 'Melissa', 'Andrew',
       'Jean', 'Frances', 'Eugene', 'Dennis', 'Andrea', 'Eric', 'Timothy',
       'Ralph', 'Henry', 'Scott', 'Laura', 'Nicholas', 'Phyllis',
       'Carolyn', 'Brenda', 'Mildred', 'Linda', 'Gregory', 'Bruce',
       'Roger', 'Harold', 'Lori', 'George', 'Thomas', 'Adam', 'Sean',
       'Donald', 'Helen', 'Earl', 'Frank', 'Shirley', 'Jack', 'Jason',
       'Debra', 'Carl', 'Annie', 'Douglas', 'Joyce', 'Ruth', 'Lillian',
       'Kelly', 'Ryan', 'Heather', 'Ernest', 'Julie', 'Karen', 'Kathleen',
       'Tina', 'Donna', 'Joan', 'Christine', 'Martin', 'Cynthia', 'Susan',
       'Kenneth', 'Carlos', 'Russell', 'Keith', 'Nicole', 'Lawrence',
       'Roy', 'Carol', 'Angela', 'Judy', 'Arthur', 'Julia', 'Harry',
       'David', 'Diane', 'Robert', 'Victor', 'Jerry', 'Beverly', 'Ruby',
       'Phillip', 'Louis', 'Jacqueline', 'Joe', 'Jimmy', 'Janet', 'Juan',
       'Mark', 'James', 'Steve', 'Kimberly', 'Gerald', 'Chris', 'Matthew',
       'Denise', 'Gary', 'Walter', 'Shawn', 'Sharon', 'Katherine', 'Ann',
       'Cheryl', 'Virginia', 'Clarence', 'Patricia', 'Bonnie', 'Janice',
       'Teresa', 'Charles', 'Anne', 'Maria', 'Dorothy', 'Catherine',
       'Albert', 'Jane', 'Willie', 'Jessica', 'Irene', 'Craig'], dtype=object)

In [16]:
# The value_counts method counts unique values in a column
count = data_file_pd["Last Name"].value_counts()
count

Tucker       10
Wright        9
Mcdonald      9
Kelly         9
Woods         8
Gray          8
Gardner       8
Parker        8
Hawkins       8
Ross          8
Kelley        8
Wheeler       8
Sullivan      8
Porter        8
Cooper        8
Willis        8
Bell          8
Lawson        8
Gutierrez     8
Williams      7
Stewart       7
George        7
Sims          7
Diaz          7
Stevens       7
Scott         7
Shaw          7
Harvey        7
Cox           7
Kim           7
             ..
Edwards       2
Thomas        2
Murphy        2
Johnson       2
Nelson        2
Ferguson      2
Jackson       2
Gibson        2
Wagner        1
Smith         1
Oliver        1
Carroll       1
Banks         1
Kennedy       1
Carr          1
Ray           1
Garcia        1
Nichols       1
Holmes        1
Brown         1
Hayes         1
Fields        1
Cole          1
Dixon         1
Henry         1
Black         1
Little        1
Allen         1
Meyer         1
Rogers        1
Name: Last Name, Length: 242, dtype: int64

In [21]:
# Calculations can also be performed on Series and added into DataFrames as new columns
thousands_of_dollars = data_file_pd["Amount"]/1000
data_file_pd["Thousands of Dollars"] = thousands_of_dollars

data_file_pd.head()

   id First Name Last Name Gender   Amount    hello  Thousands of Dollars
0   1       Todd     Lopez      M   8067.7   8.0677                8.0677
1   2     Joshua     White      M   7330.1   7.3301                7.3301
2   3       Mary     Lewis      F  16335.0  16.3350               16.3350
3   4      Emily     Burns      F  12460.8  12.4608               12.4608
4   5  Christina    Romero      F  15271.9  15.2719               15.2719